# Data analysis

## Load libraries

In [1]:
import pandas as pd
import numpy as np

## Load data

In [2]:
titanic = pd.read_csv('../../data/in/titanic_train.csv', sep=',', index_col='PassengerId')

In [3]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
titanic.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [6]:
titanic.shape

(891, 11)

In [7]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

## Statistics

In [8]:
titanic['Survived'].mean()

0.3838383838383838

In [9]:
titanic['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [10]:
titanic['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [11]:
titanic['Sex'] == 'female'

PassengerId
1      False
2       True
3       True
4       True
5      False
       ...
887    False
888     True
889     True
890    False
891    False
Name: Sex, Length: 891, dtype: bool

In [12]:
titanic.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

## Proportion of each sex

In [13]:
(titanic['Sex'] == 'female').mean()

0.35241301907968575

In [14]:
(titanic['Sex'] == 'male').mean()

0.6475869809203143

## Percentage of survivors

In [15]:
titanic[titanic['Sex'] == 'female']['Survived'].mean()

0.7420382165605095

In [16]:
titanic[titanic['Sex'] == 'male']['Survived'].mean()

0.18890814558058924

## Number of survivors

In [17]:
titanic[titanic['Sex'] == 'female']['Survived'].sum()

233

In [18]:
titanic[titanic['Sex'] == 'male']['Survived'].sum()

109

## Number of survivors by class

In [19]:
titanic[titanic['Survived'] == 1]['Pclass'].value_counts()

1    136
3    119
2     87
Name: Pclass, dtype: int64

In [20]:
titanic[titanic['Pclass'] == 3]['Survived'].mean()

0.24236252545824846

In [21]:
titanic[titanic['Pclass'] == 2]['Survived'].mean()

0.47282608695652173

In [22]:
titanic[titanic['Pclass'] == 1]['Survived'].mean()

0.6296296296296297

## Min, Max, Mean, Median

In [23]:
titanic['Age'].min()

0.42

In [24]:
titanic['Age'].max()

80.0

In [25]:
titanic['Age'].median()

28.0

In [26]:
titanic['Age'].mean()

29.69911764705882

In [27]:
titanic.min(numeric_only=True)

Survived    0.00
Pclass      1.00
Age         0.42
SibSp       0.00
Parch       0.00
Fare        0.00
dtype: float64

In [28]:
titanic.mean(numeric_only=True)

Survived     0.383838
Pclass       2.308642
Age         29.699118
SibSp        0.523008
Parch        0.381594
Fare        32.204208
dtype: float64

In [29]:
titanic.mean(numeric_only=True, skipna=True)

Survived     0.383838
Pclass       2.308642
Age         29.699118
SibSp        0.523008
Parch        0.381594
Fare        32.204208
dtype: float64

In [30]:
titanic.median(numeric_only=True)

Survived     0.0000
Pclass       3.0000
Age         28.0000
SibSp        0.0000
Parch        0.0000
Fare        14.4542
dtype: float64

## Passes

In [31]:
titanic.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [32]:
titanic.isnull()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...
887,False,False,False,False,False,False,False,False,False,True,False
888,False,False,False,False,False,False,False,False,False,False,False
889,False,False,False,False,True,False,False,False,False,True,False
890,False,False,False,False,False,False,False,False,False,False,False
891,False,False,False,False,False,False,False,False,False,True,False

In [33]:
titanic.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [34]:
titanic.isnull().mean() # in percents

Survived    0.000000
Pclass      0.000000
Name        0.000000
Sex         0.000000
Age         0.198653
SibSp       0.000000
Parch       0.000000
Ticket      0.000000
Fare        0.000000
Cabin       0.771044
Embarked    0.002245
dtype: float64

In [35]:
titanic.isnull().mean().sort_values(ascending=False)

Cabin       0.771044
Age         0.198653
Embarked    0.002245
Survived    0.000000
Pclass      0.000000
Name        0.000000
Sex         0.000000
SibSp       0.000000
Parch       0.000000
Ticket      0.000000
Fare        0.000000
dtype: float64

## Discard gaps

In [36]:
titanic.shape

(891, 11)

In [37]:
titanic.dropna(axis=1)

,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
PassengerId,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500
...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000
888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500
890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000
891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500

In [38]:
titanic.dropna(axis=0)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...
872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

## Fill in the blanks with a value

In [39]:
titanic['Age'].fillna(value=-999)

PassengerId
1       22.0
2       38.0
3       26.0
4       35.0
5       35.0
       ...
887     27.0
888     19.0
889   -999.0
890     26.0
891     32.0
Name: Age, Length: 891, dtype: float64

In [40]:
titanic['Age'].fillna(value=0)

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     0.0
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

In [41]:
titanic['Age'].fillna(value=titanic['Age'].median(), inplace=True)

## Remove duplicates

In [42]:
titanic2 = titanic.drop_duplicates()

In [43]:
titanic == titanic2

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,True,True,True,True,True,True,True,True,True,False,True
2,True,True,True,True,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True,True,True,False,True
4,True,True,True,True,True,True,True,True,True,True,True
5,True,True,True,True,True,True,True,True,True,False,True
...,...,...,...,...,...,...,...,...,...,...,...
887,True,True,True,True,True,True,True,True,True,False,True
888,True,True,True,True,True,True,True,True,True,True,True
889,True,True,True,True,True,True,True,True,True,False,True
890,True,True,True,True,True,True,True,True,True,True,True
891,True,True,True,True,True,True,True,True,True,False,True

In [44]:
(titanic == titanic2).sum()

Survived    891
Pclass      891
Name        891
Sex         891
Age         891
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

## Apply

In [45]:
def age_group(age):
    if age < 18:
        return 0
    if age < 35:
        return 1
    elif age >= 35:
        return 2

In [46]:
def row_example(row):
    if row['Age'] < 18:
        return 0
    if row['Age'] < 35:
        return 1
    elif row['Age'] >= 35:
        return 2

In [47]:
titanic.apply(row_example, axis=1)

PassengerId
1      1
2      2
3      1
4      2
5      2
      ..
887    1
888    1
889    1
890    1
891    1
Length: 891, dtype: int64

In [48]:
titanic["Age_group"] = titanic['Age'].apply(age_group)

In [49]:
titanic["Age_group"]

PassengerId
1      1
2      2
3      1
4      2
5      2
      ..
887    1
888    1
889    1
890    1
891    1
Name: Age_group, Length: 891, dtype: int64

In [50]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2

In [51]:
titanic['Age_group'].head()

PassengerId
1    1
2    2
3    1
4    2
5    2
Name: Age_group, dtype: int64

## Strings

In [52]:
titanic['Name'].apply(lambda s: s.split(',')[0])

PassengerId
1         Braund
2        Cumings
3      Heikkinen
4       Futrelle
5          Allen
         ...
887     Montvila
888       Graham
889     Johnston
890         Behr
891       Dooley
Name: Name, Length: 891, dtype: object

In [53]:
titanic['Name'].str.split(',').str[0]

PassengerId
1         Braund
2        Cumings
3      Heikkinen
4       Futrelle
5          Allen
         ...
887     Montvila
888       Graham
889     Johnston
890         Behr
891       Dooley
Name: Name, Length: 891, dtype: object

In [54]:
titanic['Name'].str.split(', ', n=1, expand=True)

                     0                                           1
PassengerId
1               Braund                             Mr. Owen Harris
2              Cumings  Mrs. John Bradley (Florence Briggs Thayer)
3            Heikkinen                                 Miss. Laina
4             Futrelle          Mrs. Jacques Heath (Lily May Peel)
5                Allen                           Mr. William Henry
...                ...                                         ...
887           Montvila                                 Rev. Juozas
888             Graham                        Miss. Margaret Edith
889           Johnston              Miss. Catherine Helen "Carrie"
890               Behr                             Mr. Karl Howell
891             Dooley                                 Mr. Patrick

[891 rows x 2 columns]

In [55]:
titanic['Name'].str.len()

PassengerId
1      23
2      51
3      22
4      44
5      24
       ..
887    21
888    28
889    40
890    21
891    19
Name: Name, Length: 891, dtype: int64

In [56]:
titanic['Name'].str.contains('Mr.')

PassengerId
1       True
2       True
3      False
4       True
5       True
       ...
887    False
888    False
889    False
890     True
891     True
Name: Name, Length: 891, dtype: bool

In [57]:
titanic['Ticket'].str.isdigit()

PassengerId
1      False
2      False
3      False
4       True
5       True
       ...
887     True
888     True
889    False
890     True
891     True
Name: Ticket, Length: 891, dtype: bool

In [58]:
titanic['Ticket'].head()

PassengerId
1           A/5 21171
2            PC 17599
3    STON/O2. 3101282
4              113803
5              373450
Name: Ticket, dtype: object

## Converting binary features

In [59]:
titanic['Sex_new'] = titanic['Sex'].apply(lambda x: 1 if x == 'male' else 'female')

In [60]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group,Sex_new
PassengerId,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,female
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,female
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,female
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,2,1

## GroupBy

In [61]:
print('female\t', titanic[titanic['Sex'] == 'female']['Survived'].mean())
print('female\t', titanic[titanic['Sex'] == 'male']['Survived'].mean())

female	 0.7420382165605095
female	 0.18890814558058924

In [62]:
titanic.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [73]:
dir(titanic.groupby('Sex'))

['Age',
 'Age_group',
 'Cabin',
 'Embarked',
 'Fare',
 'Name',
 'Parch',
 'Pclass',
 'Sex',
 'Sex_new',
 'SibSp',
 'Survived',
 'Ticket',
 '__annotations__',
 '__class__',
 '__class_getitem__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__orig_bases__',
 '__parameters__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slots__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_agg_examples_doc',
 '_agg_general',
 '_agg_py_fallback',
 '_aggregate_frame',
 '_aggregate_item_by_item',
 '_aggregate_with_numba',
 '_apply_allowlist',
 '_apply_filter',
 '_apply_to_column_groupbys',
 '_ascending_count',
 '_bool_agg',
 '_choose_path',
 '_concat_objects',
 '_constructor',
 '_cumcount_array',
 '_cython_agg_general',
 '_cython_transform',
 '_define_paths',
 '_descending_count',
 '_dir_additions',
 '_dir_deletions',
 '_fill',
 '_get_cythonized_result',
 '_get_data_to_aggregate',
 '_get_index',
 '_get_indices',
 '_gotitem',
 '_group_selection',
 '_group_selection_context',
 '_hidden_attrs',
 '_indexed_output_to_ndframe',
 '_insert_inaxis_grouper_inplace',
 '_internal_names',
 '_internal_names_set',
 '_is_protocol',
 '_iterate_column_groupbys',
 '_iterate_slices',
 '_make_mask_from_int',
 '_make_mask_from_list',
 '_make_mask_from_positional_indexer',
 '_make_mask_from_slice',
 '_make_mask_from_tuple',
 '_make_wrapper',
 '_mask_selected_obj',
 '_maybe_warn_numeric_only_depr',
 '_numba_agg_general',
 '_numba_prep',
 '_obj_1d_constructor',
 '_obj_with_exclusions',
 '_positional_selector',
 '_python_agg_general',
 '_python_apply_general',
 '_reindex_output',
 '_reset_cache',
 '_reset_group_selection',
 '_resolve_numeric_only',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_set_group_selection',
 '_set_result_index_ordered',
 '_transform',
 '_transform_general',
 '_transform_item_by_item',
 '_transform_with_numba',
 '_wrap_agged_manager',
 '_wrap_aggregated_output',
 '_wrap_applied_output',
 '_wrap_applied_output_series',
 '_wrap_transform_fast_result',
 '_wrap_transformed_output',
 'agg',
 'aggregate',
 'all',
 'any',
 'apply',
 'backfill',
 'bfill',
 'boxplot',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'dtypes',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max',
 'mean',
 'median',
 'min',
 'ndim',
 'ngroup',
 'ngroups',
 'nth',
 'nunique',
 'ohlc',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'prod',
 'quantile',
 'rank',
 'resample',
 'rolling',
 'sample',
 'sem',
 'shift',
 'size',
 'skew',
 'std',
 'sum',
 'tail',
 'take',
 'transform',
 'tshift',
 'value_counts',
 'var']

In [63]:
titanic[titanic['Parch'] == 4]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group,Sex_new
PassengerId,,,,,,,,,,,,,
168,0,3,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,1,4,347088,27.900,NaN,S,2,female
361,0,3,"Skoog, Mr. Wilhelm",male,40.0,1,4,347088,27.900,NaN,S,2,1
439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.000,C23 C25 C27,S,2,1
568,0,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,1,female

In [64]:
titanic.groupby('Parch')['Survived'].mean()

Parch
0    0.343658
1    0.550847
2    0.500000
3    0.600000
4    0.000000
5    0.200000
6    0.000000
Name: Survived, dtype: float64

## Split

In [65]:
titanic['Sex'].unique()

array(['male', 'female'], dtype=object)

In [66]:
splits = titanic.groupby('Sex')
print(list(splits))

[('female',              Survived  Pclass  \
PassengerId
2                   1       1
3                   1       3
4                   1       1
9                   1       3
10                  1       2
...               ...     ...
881                 1       2
883                 0       3
886                 0       3
888                 1       1
889                 0       3

                                                          Name     Sex   Age  \
PassengerId
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
9            Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
10                         Nasser, Mrs. Nicholas (Adele Achem)  female  14.0
...                                                        ...     ...   ...
881               Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0
883                               Dahlberg, Miss. Gerda Ulrika  female  22.0
886                       Rice, Mrs. William (Margaret Norton)  female  39.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female  28.0

             SibSp  Parch            Ticket     Fare Cabin Embarked  \
PassengerId
2                1      0          PC 17599  71.2833   C85        C
3                0      0  STON/O2. 3101282   7.9250   NaN        S
4                1      0            113803  53.1000  C123        S
9                0      2            347742  11.1333   NaN        S
10               1      0            237736  30.0708   NaN        C
...            ...    ...               ...      ...   ...      ...
881              0      1            230433  26.0000   NaN        S
883              0      0              7552  10.5167   NaN        S
886              0      5            382652  29.1250   NaN        Q
888              0      0            112053  30.0000   B42        S
889              1      2        W./C. 6607  23.4500   NaN        S

             Age_group Sex_new
PassengerId
2                    2  female
3                    1  female
4                    2  female
9                    1  female
10                   0  female
...                ...     ...
881                  1  female
883                  1  female
886                  2  female
888                  1  female
889                  1  female

[314 rows x 13 columns]), ('male',              Survived  Pclass                            Name   Sex   Age  \
PassengerId
1                   0       3         Braund, Mr. Owen Harris  male  22.0
5                   0       3        Allen, Mr. William Henry  male  35.0
6                   0       3                Moran, Mr. James  male  28.0
7                   0       1         McCarthy, Mr. Timothy J  male  54.0
8                   0       3  Palsson, Master. Gosta Leonard  male   2.0
...               ...     ...                             ...   ...   ...
884                 0       2   Banfield, Mr. Frederick James  male  28.0
885                 0       3          Sutehall, Mr. Henry Jr  male  25.0
887                 0       2           Montvila, Rev. Juozas  male  27.0
890                 1       1           Behr, Mr. Karl Howell  male  26.0
891                 0       3             Dooley, Mr. Patrick  male  32.0

             SibSp  Parch            Ticket     Fare Cabin Embarked  \
PassengerId
1                1      0         A/5 21171   7.2500   NaN        S
5                0      0            373450   8.0500   NaN        S
6                0      0            330877   8.4583   NaN        Q
7                0      0             17463  51.8625   E46        S
8                3      1            349909  21.0750   NaN        S
...            ...    ...               ...      ...   ...      ...
884              0      0  C.A./SOTON 34068  10.5000   NaN        S
885              0      0   SOTON/OQ 392076   7.0500   NaN        S
887              0      0            211536  13.0000   NaN        S
890              0      0            111369  30.0000  C148        C
891              0      0            370376   7.7500   NaN        Q

             Age_group Sex_new
PassengerId
1                    1       1
5                    2       1
6                    1       1
7                    2       1
8                    0       1
...                ...     ...
884                  1       1
885                  1       1
887                  1       1
890                  1       1
891                  1       1

[577 rows x 13 columns])]

In [74]:
splits.groups

{'female': [2, 3, 4, 9, 10, 11, 12, 15, 16, 19, 20, 23, 25, 26, 29, 32, 33, 39, 40, 41, 42, 44, 45, 48, 50, 53, 54, 57, 59, 62, 67, 69, 72, 80, 83, 85, 86, 89, 99, 101, 107, 110, 112, 114, 115, 120, 124, 129, 133, 134, 137, 141, 142, 143, 148, 152, 157, 162, 167, 168, 173, 178, 181, 185, 187, 191, 193, 195, 196, 199, 200, 206, 209, 212, 216, 217, 219, 230, 231, 234, 236, 238, 241, 242, 247, 248, 252, 255, 256, 257, 258, 259, 260, 265, 269, 270, 273, 275, 276, 277, ...], 'male': [1, 5, 6, 7, 8, 13, 14, 17, 18, 21, 22, 24, 27, 28, 30, 31, 34, 35, 36, 37, 38, 43, 46, 47, 49, 51, 52, 55, 56, 58, 60, 61, 63, 64, 65, 66, 68, 70, 71, 73, 74, 75, 76, 77, 78, 79, 81, 82, 84, 87, 88, 90, 91, 92, 93, 94, 95, 96, 97, 98, 100, 102, 103, 104, 105, 106, 108, 109, 111, 113, 116, 117, 118, 119, 121, 122, 123, 125, 126, 127, 128, 130, 131, 132, 135, 136, 138, 139, 140, 144, 145, 146, 147, 149, 150, 151, 153, 154, 155, 156, ...]}

In [75]:
splits.get_group('female')
# or titanic.loc[titanic["Sex"] == "female"]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group,Sex_new
PassengerId,,,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2,female
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,female
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2,female
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,1,female
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,0,female
...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,1,female
883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S,1,female
886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,2,female
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,female
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S,1,female

In [67]:
for (grouping_key, group) in titanic.groupby('Pclass'):
    print("grouping_key", grouping_key)
    print("group type", type(group))
    break

grouping_key 1
group type <class 'pandas.core.frame.DataFrame'>

In [68]:
for grouping_key, group in titanic.groupby(['Sex', 'Pclass']):
    print("grouping_key", grouping_key)

grouping_key ('female', 1)
grouping_key ('female', 2)
grouping_key ('female', 3)
grouping_key ('male', 1)
grouping_key ('male', 2)
grouping_key ('male', 3)

In [77]:
titanic.groupby(['Sex', 'Pclass']).groups.keys()

dict_keys([('female', 1), ('female', 2), ('female', 3), ('male', 1), ('male', 2), ('male', 3)])

In [76]:
Pclass_to_average_age = titanic.groupby('Pclass')["Age"].mean()
Pclass_to_average_age

Pclass
1    36.812130
2    29.765380
3    25.932627
Name: Age, dtype: float64

In [78]:
titanic.groupby(['Sex', 'Pclass'])['Survived'].mean()

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

In [79]:
titanic.groupby(['Pclass', 'Sex'])['Survived'].mean()

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

# Fill the gaps

In [87]:
titanic = pd.read_csv('../../data/in/titanic_train.csv', sep=',', index_col='PassengerId')

In [88]:
titanic.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [89]:
adult = (titanic['Age'] >= 18)
adult.unique()

array([ True, False])

In [90]:
adult.loc[titanic.Age.isnull()] = np.nan
adult.unique()

array([True, nan, False], dtype=object)

In [91]:
adult

PassengerId
1      True
2      True
3      True
4      True
5      True
       ...
887    True
888    True
889     NaN
890    True
891    True
Name: Age, Length: 891, dtype: object

In [92]:
adult.value_counts(dropna=False)

True     601
NaN      177
False    113
Name: Age, dtype: int64

In [93]:
titanic.groupby(adult).groups.keys()

dict_keys([False, True])

In [94]:
# Fill na
average_age = titanic['Age'].mean()
adult.fillna(average_age).value_counts()

True                 601
29.69911764705882    177
False                113
Name: Age, dtype: int64

In [95]:
titanic.groupby(adult.fillna('NA')).groups.keys()

dict_keys([False, True, 'NA'])

In [96]:
titanic.groupby(lambda s: s % 3).groups

{0: [3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120, 123, 126, 129, 132, 135, 138, 141, 144, 147, 150, 153, 156, 159, 162, 165, 168, 171, 174, 177, 180, 183, 186, 189, 192, 195, 198, 201, 204, 207, 210, 213, 216, 219, 222, 225, 228, 231, 234, 237, 240, 243, 246, 249, 252, 255, 258, 261, 264, 267, 270, 273, 276, 279, 282, 285, 288, 291, 294, 297, 300, ...], 1: [1, 4, 7, 10, 13, 16, 19, 22, 25, 28, 31, 34, 37, 40, 43, 46, 49, 52, 55, 58, 61, 64, 67, 70, 73, 76, 79, 82, 85, 88, 91, 94, 97, 100, 103, 106, 109, 112, 115, 118, 121, 124, 127, 130, 133, 136, 139, 142, 145, 148, 151, 154, 157, 160, 163, 166, 169, 172, 175, 178, 181, 184, 187, 190, 193, 196, 199, 202, 205, 208, 211, 214, 217, 220, 223, 226, 229, 232, 235, 238, 241, 244, 247, 250, 253, 256, 259, 262, 265, 268, 271, 274, 277, 280, 283, 286, 289, 292, 295, 298, ...], 2: [2, 5, 8, 11, 14, 17, 20, 23, 26, 29, 32, 35, 38, 41, 44, 47, 50, 53, 56, 59, 62, 65, 68, 71, 74, 77, 80, 83, 86, 89, 92, 95, 98, 101, 104, 107, 110, 113, 116, 119, 122, 125, 128, 131, 134, 137, 140, 143, 146, 149, 152, 155, 158, 161, 164, 167, 170, 173, 176, 179, 182, 185, 188, 191, 194, 197, 200, 203, 206, 209, 212, 215, 218, 221, 224, 227, 230, 233, 236, 239, 242, 245, 248, 251, 254, 257, 260, 263, 266, 269, 272, 275, 278, 281, 284, 287, 290, 293, 296, 299, ...]}

In [103]:
titanic.groupby(titanic.index % 3).groups

{0: [3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120, 123, 126, 129, 132, 135, 138, 141, 144, 147, 150, 153, 156, 159, 162, 165, 168, 171, 174, 177, 180, 183, 186, 189, 192, 195, 198, 201, 204, 207, 210, 213, 216, 219, 222, 225, 228, 231, 234, 237, 240, 243, 246, 249, 252, 255, 258, 261, 264, 267, 270, 273, 276, 279, 282, 285, 288, 291, 294, 297, 300, ...], 1: [1, 4, 7, 10, 13, 16, 19, 22, 25, 28, 31, 34, 37, 40, 43, 46, 49, 52, 55, 58, 61, 64, 67, 70, 73, 76, 79, 82, 85, 88, 91, 94, 97, 100, 103, 106, 109, 112, 115, 118, 121, 124, 127, 130, 133, 136, 139, 142, 145, 148, 151, 154, 157, 160, 163, 166, 169, 172, 175, 178, 181, 184, 187, 190, 193, 196, 199, 202, 205, 208, 211, 214, 217, 220, 223, 226, 229, 232, 235, 238, 241, 244, 247, 250, 253, 256, 259, 262, 265, 268, 271, 274, 277, 280, 283, 286, 289, 292, 295, 298, ...], 2: [2, 5, 8, 11, 14, 17, 20, 23, 26, 29, 32, 35, 38, 41, 44, 47, 50, 53, 56, 59, 62, 65, 68, 71, 74, 77, 80, 83, 86, 89, 92, 95, 98, 101, 104, 107, 110, 113, 116, 119, 122, 125, 128, 131, 134, 137, 140, 143, 146, 149, 152, 155, 158, 161, 164, 167, 170, 173, 176, 179, 182, 185, 188, 191, 194, 197, 200, 203, 206, 209, 212, 215, 218, 221, 224, 227, 230, 233, 236, 239, 242, 245, 248, 251, 254, 257, 260, 263, 266, 269, 272, 275, 278, 281, 284, 287, 290, 293, 296, 299, ...]}

In [104]:
titanic.groupby(lambda s: s.startswith('S'), axis=1).groups

{False: ['Pclass', 'Name', 'Age', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], True: ['Survived', 'Sex', 'SibSp']}

In [105]:
pclass_to_ave_age = titanic.groupby('Pclass')['Age'].mean().to_dict()
pclass_to_ave_age

{1: 38.233440860215055, 2: 29.87763005780347, 3: 25.14061971830986}

In [106]:
titanic.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [107]:
titanic.Age.fillna('NA', inplace=True)

In [108]:
titanic.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age           0
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [111]:
def fill_nan_in_age(row):
    if row['Age'] != 'NA':
        return  row['Age']
    else:
        pclass = row['Pclass']
        return pclass_to_ave_age[pclass]

In [112]:
titanic['Age'] = titanic.apply(fill_nan_in_age, axis=1)

In [113]:
titanic['Age']

PassengerId
1      22.00000
2      38.00000
3      26.00000
4      35.00000
5      35.00000
         ...
887    27.00000
888    19.00000
889    25.14062
890    26.00000
891    32.00000
Name: Age, Length: 891, dtype: float64

In [116]:
titanic = pd.read_csv('../../data/in/titanic_train.csv', sep=',', index_col='PassengerId')

In [117]:
pclass_sex_to_ave_age = titanic.groupby(['Pclass', 'Sex'])['Age'].mean().to_dict()
pclass_sex_to_ave_age

{(1, 'female'): 34.61176470588235,
 (1, 'male'): 41.28138613861386,
 (2, 'female'): 28.722972972972972,
 (2, 'male'): 30.74070707070707,
 (3, 'female'): 21.75,
 (3, 'male'): 26.507588932806325}

In [118]:
titanic.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [120]:
titanic.Age.fillna('NA', inplace=True)

In [121]:
titanic.Age

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889      NA
890    26.0
891    32.0
Name: Age, Length: 891, dtype: object

In [124]:
def fill_nan_in_age_v2(row):
    if row['Age'] != 'NA':
        return  row['Age']
    else:
        pclass_sex = row['Pclass'], row['Sex']
        return pclass_sex_to_ave_age[pclass_sex]

In [125]:
titanic['Age'] = titanic.apply(fill_nan_in_age_v2, axis=1)
titanic.Age

PassengerId
1      22.00
2      38.00
3      26.00
4      35.00
5      35.00
       ...
887    27.00
888    19.00
889    21.75
890    26.00
891    32.00
Name: Age, Length: 891, dtype: float64

## Aggregation

In [128]:
titanic = pd.read_csv('../../data/in/titanic_train.csv', sep=',', index_col='PassengerId')

In [129]:
splits = titanic.groupby("Sex")

In [130]:
splits.count()

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,
female,314,314,314,261,314,314,314,314,97,312
male,577,577,577,453,577,577,577,577,107,577

In [131]:
splits.nunique()

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,
female,2,3,314,63,7,7,247,156,75,3
male,2,3,577,82,7,6,519,193,96,3

In [133]:
splits.mean(numeric_only=True)

        Survived    Pclass        Age     SibSp     Parch       Fare
Sex
female  0.742038  2.159236  27.915709  0.694268  0.649682  44.479818
male    0.188908  2.389948  30.726645  0.429809  0.235702  25.523893

In [134]:
%%time
splits.Survived.mean()

CPU times: total: 0 ns
Wall time: 2 ms

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [136]:
%%time
splits.mean(numeric_only=True).Survived

CPU times: total: 0 ns
Wall time: 2 ms

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

### agg

In [138]:
splits['Survived'].agg(['mean', 'std', 'count'])

            mean       std  count
Sex
female  0.742038  0.438211    314
male    0.188908  0.391775    577